app/views/invoices/_form.html.erb

	<%
		last = Invoice.last
---
SELECT  "invoices".* FROM "invoices" ORDER BY "invoices"."id" DESC LIMIT ?  [["LIMIT", 1]]

			<% get_clients.each do |c| -%>
				<% client = Client.find(c.last)  %>
---
SELECT  "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]