app/views/invoices/show.html.erb

  <tbody id="invoicedetail_table">
    <% Invoicedetail.where(invoice: @invoice.id).each do |invoicedetail| %>
---
SELECT "invoicedetails".* FROM "invoicedetails" WHERE "invoicedetails"."invoice_id" = 89