app/views/invoicedetails/_form.html.erb

  <% end %>
  <% @invoice = Invoice.find(params[:invoice_id])%>
---
SELECT  "invoices".* FROM "invoices" WHERE "invoices"."id" = ? LIMIT ?  [["id", 45], ["LIMIT", 1]]

  <tbody id="invoicedetail_table">
    <% Invoicedetail.where(invoice: @invoice.id).each do |invoicedetail| %>
---
SELECT "invoicedetails".* FROM "invoicedetails" WHERE "invoicedetails"."invoice_id" = 47