app/controllers/clients_controller.rb

INSERT INTO "clients" ("UID", "name", "address", "telephone", "active", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @client = Client.new(client_params)

    respond_to do |format|
      if @client.save