app/controllers/inventories_controller.rb

SELECT "inventories".* FROM "inventories"
SELECT "products".* FROM "products" ORDER BY sku
---
  def index
    @inventories = Inventory.all
    @products = Product.all.order('sku')

INSERT INTO "inventories" ("product_id", "name", "quantity", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["product_id", 1], ["name", "1"], ["quantity", 1], ["created_at", "2018-02-08 18:10:02.489239"], ["updated_at", "2018-02-08 18:10:02.489239"]]
---
  def create
    @inventory = Inventory.new(inventory_params)

    respond_to do |format|
      if @inventory.save

DELETE FROM "inventories" WHERE "inventories"."id" = ?  [["id", 1]]
---
  def destroy
    @inventory.destroy

SELECT  "inventories".* FROM "inventories" WHERE "inventories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_inventory
      @inventory = Inventory.find(params[:id])