app/controllers/invoices_controller.rb

  def index
    @invoices = Invoice.all
---
SELECT "invoices".* FROM "invoices"

  def create
    @invoice = Invoice.new(invoice_params)

    respond_to do |format|
      if @invoice.save
---
INSERT INTO "invoices" ("date", "typedoc", "uid", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["date", "2018-02-19"], ["typedoc", 2], ["uid", "20537072891"], ["name", "GRUPO IPSEC SAC"], ["created_at", "2018-02-20 03:51:41.710402"], ["updated_at", "2018-02-20 03:51:41.710402"]]

  def update
    respond_to do |format|
      if @invoice.update(invoice_params)
---
UPDATE "invoices" SET "folio" = ?, "updated_at" = ? WHERE "invoices"."id" = ?  [["folio", "B001"], ["updated_at", "2018-02-09 03:18:30.537519"], ["id", 1]]

    def set_invoice
      @invoice = Invoice.find(params[:id])
---
SELECT  "invoices".* FROM "invoices" WHERE "invoices"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]