app/controllers/invoicedetails_controller.rb

SELECT "invoicedetails".* FROM "invoicedetails"
SELECT "invoices".* FROM "invoices" WHERE "invoices"."void" = ?  [["void", "f"]]
---
  def index
    @invoicedetails = Invoicedetail.all
    @invoices = Invoice.where(void:false)

INSERT INTO "invoicedetails" ("invoice_id", "sku", "name", "price", "total", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["invoice_id", 61], ["sku", "APPLE0001"], ["name", "iPhone 4 16GB"], ["price", 1000.0], ["total", 0.0], ["created_at", "2018-02-20 15:06:53.306874"], ["updated_at", "2018-02-20 15:06:53.306874"]]
SELECT  "products".* FROM "products" WHERE (sku =  'APPLE0001') ORDER BY "products"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT "invoicedetails".* FROM "invoicedetails" WHERE "invoicedetails"."invoice_id" = 69
UPDATE "invoices" SET "folio" = ?, "correlative" = ?, "netsales" = ?, "taxes" = ?, "grosssales" = ?, "updated_at" = ? WHERE "invoices"."id" = ?  [["folio", "F001"], ["correlative", "2000"], ["netsales", 6779.661016949153], ["taxes", 1220.3389830508474], ["grosssales", 8000.0], ["updated_at", "2018-02-20 19:27:28.785460"], ["id", 84]]
UPDATE "products" SET "stock" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["stock", 1000], ["updated_at", "2018-02-20 20:36:17.545841"], ["id", 1]]
---
  def create
    @invoicedetail = Invoicedetail.new(invoicedetail_params)

    respond_to do |format|
      if @invoicedetail.save
        updateinvoice(@invoicedetail.invoice_id)

        @producto = Product.where("sku =  ?",@invoicedetail.sku).first

        @producto.stock = @producto.stock - @invoicedetail.quantity
        @producto.save

SELECT  "products".* FROM "products" WHERE (sku =  'SAM0001') ORDER BY "products"."id" ASC LIMIT ?  [["LIMIT", 1]]
UPDATE "invoices" SET "netsales" = ?, "taxes" = ?, "grosssales" = ?, "updated_at" = ? WHERE "invoices"."id" = ?  [["netsales", 0.0], ["taxes", 0.0], ["grosssales", 0.0], ["updated_at", "2018-02-20 23:15:42.818885"], ["id", 97]]
UPDATE "products" SET "stock" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["stock", 9], ["updated_at", "2018-02-20 23:08:09.688470"], ["id", 5]]
SELECT  "invoices".* FROM "invoices" WHERE "invoices"."id" = ? ORDER BY "invoices"."id" ASC LIMIT ?  [["id", 97], ["LIMIT", 1]]
DELETE FROM "invoicedetails" WHERE "invoicedetails"."id" = ?  [["id", 3]]
---
  def destroy
    id = @invoicedetail.invoice_id

        @producto = Product.where("sku =  ?",@invoicedetail.sku).first
        @producto.stock = @producto.stock + @invoicedetail.quantity
        @producto.save

        @comprobante = Invoice.where(id:  @invoicedetail.invoice_id).first
        @comprobante.netsales = @comprobante.netsales - (@invoicedetail.total/1.18)
        @comprobante.taxes = @comprobante.taxes - (@invoicedetail.price/1.18*0.18)
        @comprobante.grosssales = @comprobante.grosssales - (@invoicedetail.total)
        @comprobante.save


    @invoicedetail.destroy

SELECT  "invoicedetails".* FROM "invoicedetails" WHERE "invoicedetails"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def set_invoicedetail
      @invoicedetail = Invoicedetail.find(params[:id])