app/controllers/products_controller.rb

SELECT "products".* FROM "products" ORDER BY sku
---
  def index
    @products = Product.all.order('sku')

INSERT INTO "products" ("sku", "name", "price", "stock", "active", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["sku", "AL1"], ["name", "CEBOLLA"], ["price", 10.0], ["stock", 5], ["active", "f"], ["created_at", "2018-02-08 18:28:00.455144"], ["updated_at", "2018-02-08 18:28:00.455144"]]
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save

UPDATE "products" SET "price" = ?, "stock" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["price", 500.0], ["stock", 10], ["updated_at", "2018-02-20 21:13:49.626049"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @product.update(product_params)